using System;
using System.Collections.Generic;
using System.Diagnostics.Contracts;
using System.Text;

namespace MESCL
{
    public class Tokenizator
    {
        public enum ТипТокена
        {
            КодСлово,
            Идентификатор,
            Присвоить,
            Равно,
            Номер,
            Строка,
            ДелительФункции,
            Действия,
            КонецДействий,
            Минус,
            Плюс,
            Множить,
            Делить,
            Запятая,
            Точка,
            Перенос,
            СОТКР,
            СЗАКР,
            Обозначить,
            ВстройФукнция

        }

        public static List<Dictionary<string,(ТипТокена, string)>> Токенизовать(string str)
        {
            var одиночные = new Dictionary<char, ТипТокена>
            {
                [';'] = ТипТокена.ДелительФункции,
                ['$'] = ТипТокена.Действия,
                ['#'] = ТипТокена.КонецДействий,
                ['-'] = ТипТокена.Минус,
                ['+'] = ТипТокена.Плюс,
                ['/'] = ТипТокена.Делить,
                ['*'] = ТипТокена.Множить,
                [','] = ТипТокена.Запятая,
                ['.'] = ТипТокена.Точка,
                ['\n'] = ТипТокена.Перенос,
                ['('] = ТипТокена.СОТКР,
                [')'] = ТипТокена.СЗАКР,
                [':'] = ТипТокена.Обозначить
            };

            var токены = new List<Dictionary<string, (ТипТокена, string)>>();

            int i = 0;

            string буффер = String.Empty;

            while (i < str.Length)
            {
                if (одиночные.TryGetValue(str[i], out var типТокена))
                {
                    var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                    одинТокен["токен"] = (типТокена, str[i].ToString());
                    токены.Add(одинТокен);
                }
                else if (str[i] == '=')
                {
                    if (i + 1 < str.Length && str[i + 1] == '=')
                    {
                        i++;
                        var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                        одинТокен["токен"] = (ТипТокена.Равно, "==");
                        токены.Add(одинТокен);
                    }
                    else
                    {
                        var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                        одинТокен["токен"] = (ТипТокена.Присвоить, "=");
                        токены.Add(одинТокен);
                    }
                }
                else if (char.IsDigit(str[i]))
                {
                    буффер += str[i];
                    i++;
                    while (i < str.Length && char.IsDigit(str[i]))
                    {
                        буффер += str[i];
                        i++;
                    }
                    i -= 1;

                    var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                    одинТокен["токен"] = (ТипТокена.Номер, буффер);
                    токены.Add(одинТокен);
                    буффер = String.Empty;

                }
                else if (str[i] == '"')
                {
                    i++;
                    while (i < str.Length && str[i] != '"')
                    {
                        буффер += str[i];
                        i++;
                        if (i >= str.Length)
                        {
                            throw new Exception("Незакрытая строковая константа");
                        }
                    }
                    var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                    одинТокен["токен"] = (ТипТокена.Строка, буффер);
                    токены.Add(одинТокен);
                    буффер = String.Empty;
                }
                else if (char.IsLetter(str[i]))
                {
                    буффер += str[i];
                    i++;
                    while (i < str.Length && char.IsLetter(str[i]))
                    {
                        буффер += str[i];
                        i++;
                    }
                    i -= 1;
                    if (буффер == "переменная")
                    {
                        var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                        одинТокен["токен"] = (ТипТокена.КодСлово, буффер);
                        токены.Add(одинТокен);
                    }
                    else if (буффер == "пропуск")
                    {
                        var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                        одинТокен["токен"] = (ТипТокена.КодСлово, буффер);
                        токены.Add(одинТокен);
                    }
                    else if (буффер == "если")
                    {
                        var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                        одинТокен["токен"] = (ТипТокена.КодСлово, буффер);
                        токены.Add(одинТокен);
                    }
                    else if (буффер == "иначе")
                    {
                        var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                        одинТокен["токен"] = (ТипТокена.КодСлово, буффер);
                        токены.Add(одинТокен);
                    }
                    else if (буффер == "инесли")
                    {
                        var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                        одинТокен["токен"] = (ТипТокена.КодСлово, буффер);
                        токены.Add(одинТокен);
                    }
                    else if (буффер == "метод")
                    {
                        var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                        одинТокен["токен"] = (ТипТокена.КодСлово, буффер);
                        токены.Add(одинТокен);
                    }
                    else if (буффер == "класс")
                    {
                        var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                        одинТокен["токен"] = (ТипТокена.КодСлово, буффер);
                        токены.Add(одинТокен);
                    }
                    else if (буффер == "защ")
                    {
                        var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                        одинТокен["токен"] = (ТипТокена.КодСлово, буффер);
                        токены.Add(одинТокен);
                    }
                    else if (буффер == "наследует")
                    {
                        var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                        одинТокен["токен"] = (ТипТокена.КодСлово, буффер);
                        токены.Add(одинТокен);
                    }
                    else if (буффер == "корутина")
                    {
                        var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                        одинТокен["токен"] = (ТипТокена.КодСлово, буффер);
                        токены.Add(одинТокен);
                    }
                    else if (буффер == "отладить")
                    {
                        var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                        одинТокен["токен"] = (ТипТокена.ВстройФукнция, буффер);
                        токены.Add(одинТокен);
                    }
                    else if (буффер == "задержка")
                    {
                        var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                        одинТокен["токен"] = (ТипТокена.ВстройФукнция, буффер);
                        токены.Add(одинТокен);
                    }
                    else
                    {
                        var одинТокен = new Dictionary<string, (ТипТокена, string)>();
                        одинТокен["токен"] = (ТипТокена.Идентификатор, буффер);
                        токены.Add(одинТокен);
                    }
                    буффер = String.Empty;
                }

                i++;
            }

            return токены;
        }
    }
}
